#### Terraform Format and Style 🖌
#### Environment staging (CD)
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
confluent_environment.env: Refreshing state... [id=env-632ky2]
confluent_kafka_cluster.standard: Refreshing state... [id=lkc-pk6w32]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # confluent_api_key.platform-manager-kafka-api-key will be created
  + resource "confluent_api_key" "platform-manager-kafka-api-key" {
      + description            = "Kafka API Key that is owned by 'platform-manager' service account"
      + disable_wait_for_ready = false
      + display_name           = "platform-manager-kafka-api-key"
      + id                     = (known after apply)
      + secret                 = (sensitive value)

      + managed_resource {
          + api_version = "cmk/v2"
          + id          = "lkc-pk6w32"
          + kind        = "Cluster"

          + environment {
              + id = "env-632ky2"
            }
        }

      + owner {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)
        }
    }

  # confluent_role_binding.platform-manager-kafka-cluster-admin will be created
  + resource "confluent_role_binding" "platform-manager-kafka-cluster-admin" {
      + crn_pattern = "crn://confluent.cloud/organization=6c45aedc-ad4c-4ae8-983b-87af5b96ba62/environment=env-632ky2/cloud-cluster=lkc-pk6w32"
      + id          = (known after apply)
      + principal   = (known after apply)
      + role_name   = "CloudClusterAdmin"
    }

  # confluent_service_account.platform-manager will be created
  + resource "confluent_service_account" "platform-manager" {
      + api_version  = (known after apply)
      + description  = "Service account to manage the platform"
      + display_name = "platform-manager-staging"
      + id           = (known after apply)
      + kind         = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>
*Pushed by: @gphilipp, Action: `pull_request`*